app/Controllers/Api/Auth.php

    public function login()
    {
        // SUNTIKKAN CORS HEADER SECARA PAKSA
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Headers: X-API-KEY, Origin, X-Requested-With, Content-Type, Accept, Access-Control-Request-Method, Authorization");
        header("Access-Control-Allow-Methods: GET, POST, OPTIONS, PUT, DELETE");

        if (isset($_SERVER['REQUEST_METHOD']) && $_SERVER['REQUEST_METHOD'] === "OPTIONS") {
            return $this->respond(null, 200);
        }

        // Membaca input payload JSON mentah dari Axios
        $json = $this->request->getJSON();
        $username = $json->username ?? $this->request->getVar('username');
        $password = $json->password ?? $this->request->getVar('password');

        if (empty($username) || empty($password)) {
            return $this->fail('Username dan Password tidak boleh kosong.', 400);
        }

        $model = new UserModel();

        try {
            // Mencari user berdasarkan username atau email di database
            $user = $model->where('username', $username)
                          ->orWhere('useremail', $username)
                          ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
OR `useremail` = 'admin'
 LIMIT 1