app/Controllers/Post.php

    public function create()
    {
        $model = new ArtikelModel();
        $judul = $this->request->getJsonVar('judul');
        $isi   = $this->request->getJsonVar('isi');
        $slug  = url_title($judul, '-', true);

        $data = [
            'judul'       => $judul,
            'isi'         => $isi,
            'slug'        => $slug,
            'status'      => '0',
            'gambar'      => null,
            'id_kategori' => 1
        ];

        if ($model->insert($data)) {
---
INSERT INTO `artikel` (`judul`, `isi`, `slug`, `status`, `gambar`, `id_kategori`) VALUES ('Belajar My SQL', 'SEMANGAT BELAJAR MY SQL NYA YAAA', 'belajar-my-sql', '0', NULL, 1)